{
	"inform.description.MOVJ": "Moves to the teaching position by joint interpolation.",
	"inform.description.MOVL": "Moves to the teaching position by linear interpolation.",
	"inform.description.MOVC": "Moves to the teaching position by circular interpolation.",
	"inform.description.MOVS": "Moves to the teaching position by spline interpolation.",
	"inform.description.IMOV": "Moves by linear interpolation from the current position for the specified incremental value.",
	"inform.description.SPEED": "Sets the playback speed. The manipulator operates at the speed specified in the SPEED instruction when the speed is not specified in the move instruction.",
	"inform.description.REFP": "It is an instruction which has the position data by which a supplementary point of the wall point, etc. for weaving is set.",

	"inform.description.SFTON": "Begins the parallel shift operation. The amount of the parallel shift is set in a position variable by the increment value of X, Y, and Z in each coordinate system.",
	"inform.description.SFTOF": "Ends the parallel shift operation.",
	"inform.description.MSHIFT": "Calculates the amount of the shift in the specified coordinate system according to Data 2 and Data 3 and stores the result in Data 1. Data 2 indicates the reference position to carry out the parallel shift, and Data 3 is the target position (shifted position).",
	"inform.description.SFTON3D": "Begins the 3D shift operation. The amount of the 3D shift is set in a positional variable. This instruction can be used only when the multi-layer welding function (optional function) is enabled.",
	"inform.description.SFTOF3D": "Ends the 3D shift operation.  This instruction can be used only when the multi-layer welding function (optional function) is enabled.",

	"inform.description.DOUT": "Turns the GP output signal ON and OFF.",
	"inform.description.DIN": "The signal status is read in the byte type/double length type variable.",
	"inform.description.WAIT": "Wait until the various statuses coincide with the specified status.",
	"inform.description.PULSE": "The pulse signal is output to the GP output signal only for the specified time.  The PULSE instruction executes the next instruction without waiting for the completion of pulse output (the specified output time). However, in case the pulse output of the previous executed PULSE instruction is not completed, this time PULSE instruction is executed after the completion when the instruction is executed continuously for the same signal.",
	"inform.description.AOUT": "Outputs the set voltage value to the general-purpose analog output port.",
	"inform.description.ARATION": "Starts the analog output corresponding to the speed. The ARATION instruction is effective during the linear interpolation motion, the circular interpolation motion and the spline interpolation motion. This instruction is executed during playback, test run, or FWD operation and not executed during the axis operation.",
	"inform.description.ARATIOF": "Cancels the analog output corresponding to the speed.",
	"inform.description.ANTOUT": "Carries out the anticipation output function to adjust the timing of the signal output.",

	"inform.description.JUMP": "Jumps to specified label or job.",
	"inform.description.CALL": "Calls the specified job.",
	"inform.description.TIMER": "Stops for the specified time.",
	"inform.description.RET": "Returns from the called job to the calling job.",
	"inform.description.NOP": "This command is required at the beginning of the job.  Carries out no operation.",
	"inform.description.PAUSE": "Stops the job temporarily.",
	"inform.description.ABORT": "Suspends playback. After the playback is suspended by ABORT instruction, it will not restart until the job is reselected on the JOB SELECT window.",
	"inform.description.CWAIT": "Releases the NWAIT execution (which simultaneously executes the manipulator operation and instructions excluding the move instruction) and waits for the next instruction line to be carried out. CWAIT is used with the NWAIT tag, an additional item of a move instruction.",
	"inform.description.MSG": "Displays the message.",
	"inform.description.INPUT": "Displays the value input window accordance with the specified variable.",
	"inform.description.ADVINIT": "When the same variable is used for multiple systems in the optional independent control function, ADVINIT controls the timing to change the variable data among the systems. ADVINIT is an instruction used to control YRC1000 internal processing, therefore, executing this instruction does not affect the job.",
	"inform.description.ADVSTOP": "When the same variable is used for multiple systems in the optional independent control function, ADVSTOP controls the access timing of the variable data among the systems. ADVSTOP is an instruction used to control YRC1000 internal processing, therefore, executing this instruction does not affect the job.",
	"inform.description.PRINT": "Shows the specified character string and variable on the terminal display. * Terminal display: Select {Main Menu}, {IN/OUT}, then {TERMINAL} to show it. If the independent control function is enabled, the page is different for each task.",
	"inform.description.CLS": "Deletes the character string shown on the terminal display.",
	"inform.description.SETUALM": "Generates an alarm with any given number, name and sub code.",
	"inform.description.DIALOG": "Shows the dialog during the execution of job. If the current display is not the PLAYBACK window, the PLAYBACK window is displayed when the dialog is shown by the execution of DIALOG instruction. The job does not proceed while the dialog is shown (waiting for button input).",
	"inform.description.SWITCH": "This instruction refers to the specified variable, and determines the next instruction to perform. Combining the CASE instruction or the DEFAULT instruction enables to branch the more than three directions.",
	"inform.description.CASE": "This instruction adds a branch of the next instruction for the SWITCH instruction. This instruction can be registered between SWITCH and ENDSWITCH. The multiple CASE instructions can be registered within range.",
	"inform.description.DEFAULT": "This instruction determines a location to execute the instruction when the instruction does not corresponded to the any branches of the SWITCH. This instruction can be only registered between SWITCH and ENDSWITCH. Able to register only one instruction within a range.",
	"inform.description.WHILE": "Determines true or false of the added conditional expression, and execute the series of instructions within a range when it is true. Repeats the instruction as long as the conditional expression is true.",
	"inform.description.FOR": "Executes the repetition of the series of the instructions for specified number of times within a range.",
	"inform.description.IFTHEN": "Determines true or false of the added conditional expression, and then execute the next instruction. Enables to operate the sequential processing by combining the ELSEIF instruction and ELSE instruction.",
	"inform.description.ELSEIF": "Executes the new conditional expression if the conditional expression of the IFTHEN instruction or the ELSEIF instruction is false. This instruction can be registered only between IFTHEN and ENDIF. The multiple ELSIF instructions can be registered within a range.",
	"inform.description.ELSE": "This instruction determines a location to execute the instruction when the all instructions do not corresponded to the any branches of the SWITCH. This instruction can be registered only between IFTHEN and ENDIF. Able to register only one instruction within a range.",
	"inform.description.SETTM": "Execute these function, such as to start measuring, to end, to reset, and to set the time.",
	"inform.description.EI": "Enable inturrupt.",
	"inform.description.DI": "Disable interrupt",

	"inform.description.CLEAR": "In Data 1, the variable content from the specified number on, is cleared to 0 only by the amount specified in Data 2.",
	"inform.description.INC": "Adds one to the content of the specified variable.",
	"inform.description.DEC": "Subtracts 1 from a specified variable.",
	"inform.description.SET": "Sets Data 2 to Data 1.",
	"inform.description.ADD": "Recommend to use SET command.\n\nAdds Data 1 and Data 2, and stores the result in Data 1.\n\nADD Data1 Data2  \n-> SET Data1 EXPRESS Data1 + Data2",
	"inform.description.SUB": "Recommend to use SET command.\n\nSubtracts Data 2 from Data 1, and stores the result in Data 1.\n\nSUB Data1 Data2  \n-> SET Data1 EXPRESS Data1 - Data2",
	"inform.description.MUL": "Recommend to use SET command.\n\nMultiplies Data 1 by Data 2, and stores the result in Data 1.\n\nMUL Data1 Data2  \n-> SET Data1 EXPRESS Data1 * Data2",
	"inform.description.DIV": "Recommend to use SET command.\n\nDivides Data 1 by Data 2, and stores the result in Data 1.\n\nDIV Data1 Data2  \n-> SET Data1 EXPRESS Data1 / Data2",
	"inform.description.CNVRT": "Converts the pulse type position type variable of Data 2 to the XYZ type position type variable in the specified coordinate system, and stores the result in Data 1.",
	"inform.description.AND": "Carries out logical multiplication of Data 1 and Data 2, and stores the result in Data 1.",
	"inform.description.OR": "Carries out the logical sum of Data 1 and Data 2, and stores the result in Data 1.",
	"inform.description.NOT": "Carries out the logical negation of Data 2, and stores the result in Data 1.",
	"inform.description.XOR": "Carries out the logical exclusive OR of Data 1 and Data 2, and stores the result in Data 1.",
	"inform.description.MFRAME": "By using this instruction, the user coordinates are generated from the position data.",
	"inform.description.SETE": "Sets Data 2 in the element of position type variable of Data 1.",
	"inform.description.GETE": "Stores the element of position type variable of Data 2 in Data 1.",
	"inform.description.GETS": "Stores the system variable of Data 2 in Data 1.",
	"inform.description.SQRT": "Calculates the square root of Data 2, and stores the result in Data 1.",
	"inform.description.SIN": "Calculates the sine of Data 2(Units: deg), and stores the result in Data 1.",
	"inform.description.COS": "Calculates the cosine of Data 2(Units: deg), and stores the result in Data 1.",
	"inform.description.ATAN": "Calculates the arc tangent of Data 2, and stores the result in Data 1.",
	"inform.description.MULMAT": "Calculates the matrix multiplication of Data 2 and Data 3, and stores the result in Data 1.",
	"inform.description.INVMAT": "Calculates the inverse matrix of Data 2, and stores the result in Data 1.",
	"inform.description.GETPOS": "Stores the position data of the data2 (step number) in Data 1.",
	"inform.description.VAL": "Converts the numeric values of the character string (ASCII) in the data2 into the real value, and stores the result in data1.",
	"inform.description.VAL2STR": "The data2 value, which is converted into the character, is stored in the data1.",
	"inform.description.ASC": "Retrieves the first character code of the character string (ASCII) of the data2, and stores it in Data 1.",
	"inform.description.CHR$": "The character (ASCII), which contains the character code of the data2 is retrieved, and it is stored in Data 1.",
	"inform.description.MID$": "Extracts the any length (data 3, 4) of the character string (ASCII) from the character strings (ASCII) in the data2, and stores the result in Data 1.",
	"inform.description.LEN": "Retrieves the total number of the character string (ASCII) of the data2, and stores the result in Data 1.",
	"inform.description.CAT$": "Combines the character strings (ASCII) from the data2 and the data3, and stores the result in Data1.",
	"inform.description.STRSTR": "The first position where the same character string as the data2 appears in the data3 is stored into the data1.",
	"inform.description.GETARG": "This is the instruction to receive arguments for the CALL instruction and macro instruction. When the instruction is executed, the argument data added to the CALL instruction or macro instruction is retrieved, then stored in the local variable specified to be used in the CALL job or macro job.",
	"inform.description.GETNAME": "Stores the name data of the data2 into data1.",
	"inform.description.SETFILE": "Changes the specified data of the specified condition file to the numeric data of Data 1. Specify the data of the condition file to be changed by its element number.",
	"inform.description.GETFILE": "Stores the data of the specified condition file in Data 1. Specify the data of the condition file to be obtained by its element number.",
	"inform.description.SETREG": "opies the specified integer type variable data into the register.",
	"inform.description.GETREG": "Copies the specified register data into the integer type variable.",
	"inform.description.GETPRM": "Stores the specified parameter into the specified variable. It can be only used at the macro job when the macro command (optional) is valid.",
	"inform.description.SETPRM": "Changes the specified parameter into the specified variable. It can be only used at the macro job when the macro command (optional) is valid.",

	"inform.description.ARCON": "Outputs the welding start command.",
	"inform.description.ARCOF": "Outputs welding end command.",
	"inform.description.VWELD": "Sets the welding voltage by the voltage command value.",
	"inform.description.AWELD": "Sets the welding current by the current command position.",
	"inform.description.ARCSET": "Sets and changes each welding condition individually.",
	"inform.description.WVON": "Starts weaving operation.",
	"inform.description.WVOF": "Ends weaving operation.",
	"inform.description.ARCCTS": "Controls the welding current and the voltage in the specified starting section. This function is used with the move instruction. The current and the voltage are changed while the manipulator is moving. The aimed value and section have to be set. The section is specified as a distance from the moving start point. If it is not specified, it is regarded as the entire section of the move instruction.",
	"inform.description.ARCCTE": "Controls the welding current and the voltage in the specified end section.",

	"inform.description.HAND": "Turns the signal to the tool valve ON or OFF to control the tool.",
	"inform.description.HSEN": "Monitors the input status of the tool sensor. Stores the result in the system variable $B006.",

	"inform.description.TOOLON": "Turns ON the work start instruction (dedicated output relay #51530) and waits for the work start response (dedicated input relay #41130). When the work start response is turned ON, the next instruction is carried out.",
	"inform.description.TOOLOF": "Turns OFF the work instruction. Turns ON the work end instruction (dedicated output relay #51531) and waits for the work end response (dedicated input relay #41131). When the work end response is turned ON, the next instruction is carried out.",

	"inform.description.GUNCL": "Applies pressure to the air gun.",
	"inform.description.SPOT": "Starts the welding sequence after pressure has been applied to the air gun.",
	"inform.description.STROKE": "Switches the open status of the 2-step stroke gun to/from Full open to/from Short open when not welding.",
	"inform.description.STRWAIT": "Confirms the specified open status of a 2-step stroke gun as short open or full open when not welding. Wait until the signal of the specified open status, short open or full open, is turned ON.",


	"jbifile.hover.lineNo": "Line #{0}",

	"jbifile.diagnostic.tag.T=.invalidValueRange": "T value should be 0 to 655.35.",
	"jbifile.diagnostic.tag.T=.warningValueRange": "T value should be equal or less than 65.535 in YRC1000micro.",
	"jbifile.diagnostic.tag.T=.warningDecimalRange": "T value's decimal place should be up to 2 in YRC1000.",
	"pscfile.diagnostic.paramMatch": "Matched with ALL.PRM",
	"pscfile.diagnostic.paramUnmatch": "{0} value '{1}' is NOT match with ALL.PRM value '{2}'.",
	"pscfile.diagnostic.paramNotFound": "{0} is NOT found in ALL.PRM.",

	"":""
}